GopalSaraf/Practicals/PSDL/include/proc/pic16lf18855.inc
// Register: T0CON1
#define T0CON1 T0CON1
T0CON1                                   equ 001Fh
// bitfield definitions
T0CON1_T0CKPS_POSN                       equ 0000h
T0CON1_T0CKPS_POSITION                   equ 0000h
T0CON1_T0CKPS_SIZE                       equ 0004h
T0CON1_T0CKPS_LENGTH                     equ 0004h
T0CON1_T0CKPS_MASK                       equ 000Fh
T0CON1_T0ASYNC_POSN                      equ 0004h
T0CON1_T0ASYNC_POSITION                  equ 0004h
T0CON1_T0ASYNC_SIZE                      equ 0001h
T0CON1_T0ASYNC_LENGTH                    equ 0001h
T0CON1_T0ASYNC_MASK                      equ 0010h
T0CON1_T0CS_POSN                         equ 0005h
T0CON1_T0CS_POSITION                     equ 0005h
T0CON1_T0CS_SIZE                         equ 0003h
T0CON1_T0CS_LENGTH                       equ 0003h
T0CON1_T0CS_MASK                         equ 00E0h
T0CON1_T0CKPS0_POSN                      equ 0000h
T0CON1_T0CKPS0_POSITION                  equ 0000h
T0CON1_T0CKPS0_SIZE                      equ 0001h
T0CON1_T0CKPS0_LENGTH                    equ 0001h
T0CON1_T0CKPS0_MASK                      equ 0001h
T0CON1_T0CKPS1_POSN                      equ 0001h
T0CON1_T0CKPS1_POSITION                  equ 0001h
T0CON1_T0CKPS1_SIZE                      equ 0001h
T0CON1_T0CKPS1_LENGTH                    equ 0001h
T0CON1_T0CKPS1_MASK                      equ 0002h
T0CON1_T0CKPS2_POSN                      equ 0002h
T0CON1_T0CKPS2_POSITION                  equ 0002h
T0CON1_T0CKPS2_SIZE                      equ 0001h
T0CON1_T0CKPS2_LENGTH                    equ 0001h
T0CON1_T0CKPS2_MASK                      equ 0004h
T0CON1_T0CKPS3_POSN                      equ 0003h
T0CON1_T0CKPS3_POSITION                  equ 0003h
T0CON1_T0CKPS3_SIZE                      equ 0001h
T0CON1_T0CKPS3_LENGTH                    equ 0001h
T0CON1_T0CKPS3_MASK                      equ 0008h
T0CON1_T0CS0_POSN                        equ 0005h
T0CON1_T0CS0_POSITION                    equ 0005h
T0CON1_T0CS0_SIZE                        equ 0001h
T0CON1_T0CS0_LENGTH                      equ 0001h
T0CON1_T0CS0_MASK                        equ 0020h
T0CON1_T0CS1_POSN                        equ 0006h
T0CON1_T0CS1_POSITION                    equ 0006h
T0CON1_T0CS1_SIZE                        equ 0001h
T0CON1_T0CS1_LENGTH                      equ 0001h
T0CON1_T0CS1_MASK                        equ 0040h
T0CON1_T0CS2_POSN                        equ 0007h
T0CON1_T0CS2_POSITION                    equ 0007h
T0CON1_T0CS2_SIZE                        equ 0001h
T0CON1_T0CS2_LENGTH                      equ 0001h
T0CON1_T0CS2_MASK                        equ 0080h
T0CON1_T0PS0_POSN                        equ 0000h
T0CON1_T0PS0_POSITION                    equ 0000h
T0CON1_T0PS0_SIZE                        equ 0001h
T0CON1_T0PS0_LENGTH                      equ 0001h
T0CON1_T0PS0_MASK                        equ 0001h
T0CON1_T0PS1_POSN                        equ 0001h
T0CON1_T0PS1_POSITION                    equ 0001h
T0CON1_T0PS1_SIZE                        equ 0001h
T0CON1_T0PS1_LENGTH                      equ 0001h
T0CON1_T0PS1_MASK                        equ 0002h
T0CON1_T0PS2_POSN                        equ 0002h
T0CON1_T0PS2_POSITION                    equ 0002h
T0CON1_T0PS2_SIZE                        equ 0001h
T0CON1_T0PS2_LENGTH                      equ 0001h
T0CON1_T0PS2_MASK                        equ 0004h
T0CON1_T0PS3_POSN                        equ 0003h
T0CON1_T0PS3_POSITION                    equ 0003h
T0CON1_T0PS3_SIZE                        equ 0001h
T0CON1_T0PS3_LENGTH                      equ 0001h
T0CON1_T0PS3_MASK                        equ 0008h
T0CON1_T0PS_POSN                         equ 0000h
T0CON1_T0PS_POSITION                     equ 0000h
T0CON1_T0PS_SIZE                         equ 0004h
T0CON1_T0PS_LENGTH                       equ 0004h
T0CON1_T0PS_MASK                         equ 000Fh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 008Ch
// bitfield definitions
ADRESL_ADRESL_POSN                       equ 0000h
ADRESL_ADRESL_POSITION                   equ 0000h
ADRESL_ADRESL_SIZE                       equ 0008h
ADRESL_ADRESL_LENGTH                     equ 0008h
ADRESL_ADRESL_MASK                       equ 00FFh

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 008Dh

// Register: ADPREVL
#define ADPREVL ADPREVL
ADPREVL                                  equ 008Eh
// bitfield definitions
ADPREVL_ADPREVL_POSN                     equ 0000h
ADPREVL_ADPREVL_POSITION                 equ 0000h
ADPREVL_ADPREVL_SIZE                     equ 0008h
ADPREVL_ADPREVL_LENGTH                   equ 0008h
ADPREVL_ADPREVL_MASK                     equ 00FFh
ADPREVL_ADPREV0_POSN                     equ 0000h
ADPREVL_ADPREV0_POSITION                 equ 0000h
ADPREVL_ADPREV0_SIZE                     equ 0001h
ADPREVL_ADPREV0_LENGTH                   equ 0001h
ADPREVL_ADPREV0_MASK                     equ 0001h
ADPREVL_ADPREV1_POSN                     equ 0001h
ADPREVL_ADPREV1_POSITION                 equ 0001h
ADPREVL_ADPREV1_SIZE                     equ 0001h
ADPREVL_ADPREV1_LENGTH                   equ 0001h
ADPREVL_ADPREV1_MASK                     equ 0002h
ADPREVL_ADPREV2_POSN                     equ 0002h
ADPREVL_ADPREV2_POSITION                 equ 0002h
ADPREVL_ADPREV2_SIZE                     equ 0001h
ADPREVL_ADPREV2_LENGTH                   equ 0001h
ADPREVL_ADPREV2_MASK                     equ 0004h
ADPREVL_ADPREV3_POSN                     equ 0003h
ADPREVL_ADPREV3_POSITION                 equ 0003h
ADPREVL_ADPREV3_SIZE                     equ 0001h
ADPREVL_ADPREV3_LENGTH                   equ 0001h
ADPREVL_ADPREV3_MASK                     equ 0008h
ADPREVL_ADPREV4_POSN                     equ 0004h
ADPREVL_ADPREV4_POSITION                 equ 0004h
ADPREVL_ADPREV4_SIZE                     equ 0001h
ADPREVL_ADPREV4_LENGTH                   equ 0001h
ADPREVL_ADPREV4_MASK                     equ 0010h
ADPREVL_ADPREV5_POSN                     equ 0005h
ADPREVL_ADPREV5_POSITION                 equ 0005h
ADPREVL_ADPREV5_SIZE                     equ 0001h
ADPREVL_ADPREV5_LENGTH                   equ 0001h
ADPREVL_ADPREV5_MASK                     equ 0020h
ADPREVL_ADPREV6_POSN                     equ 0006h
ADPREVL_ADPREV6_POSITION                 equ 0006h
ADPREVL_ADPREV6_SIZE                     equ 0001h
ADPREVL_ADPREV6_LENGTH                   equ 0001h
ADPREVL_ADPREV6_MASK                     equ 0040h
ADPREVL_ADPREV7_POSN                     equ 0007h
ADPREVL_ADPREV7_POSITION                 equ 0007h
ADPREVL_ADPREV7_SIZE                     equ 0001h
ADPREVL_ADPREV7_LENGTH                   equ 0001h
ADPREVL_ADPREV7_MASK                     equ 0080h

