GopalSaraf/Practicals/PSDL/include/proc/pic16lf18855.inc
// Register: CWG3DBR
#define CWG3DBR CWG3DBR
CWG3DBR                                  equ 068Eh
// bitfield definitions
CWG3DBR_DBR_POSN                         equ 0000h
CWG3DBR_DBR_POSITION                     equ 0000h
CWG3DBR_DBR_SIZE                         equ 0006h
CWG3DBR_DBR_LENGTH                       equ 0006h
CWG3DBR_DBR_MASK                         equ 003Fh
CWG3DBR_DBR0_POSN                        equ 0000h
CWG3DBR_DBR0_POSITION                    equ 0000h
CWG3DBR_DBR0_SIZE                        equ 0001h
CWG3DBR_DBR0_LENGTH                      equ 0001h
CWG3DBR_DBR0_MASK                        equ 0001h
CWG3DBR_DBR1_POSN                        equ 0001h
CWG3DBR_DBR1_POSITION                    equ 0001h
CWG3DBR_DBR1_SIZE                        equ 0001h
CWG3DBR_DBR1_LENGTH                      equ 0001h
CWG3DBR_DBR1_MASK                        equ 0002h
CWG3DBR_DBR2_POSN                        equ 0002h
CWG3DBR_DBR2_POSITION                    equ 0002h
CWG3DBR_DBR2_SIZE                        equ 0001h
CWG3DBR_DBR2_LENGTH                      equ 0001h
CWG3DBR_DBR2_MASK                        equ 0004h
CWG3DBR_DBR3_POSN                        equ 0003h
CWG3DBR_DBR3_POSITION                    equ 0003h
CWG3DBR_DBR3_SIZE                        equ 0001h
CWG3DBR_DBR3_LENGTH                      equ 0001h
CWG3DBR_DBR3_MASK                        equ 0008h
CWG3DBR_DBR4_POSN                        equ 0004h
CWG3DBR_DBR4_POSITION                    equ 0004h
CWG3DBR_DBR4_SIZE                        equ 0001h
CWG3DBR_DBR4_LENGTH                      equ 0001h
CWG3DBR_DBR4_MASK                        equ 0010h
CWG3DBR_DBR5_POSN                        equ 0005h
CWG3DBR_DBR5_POSITION                    equ 0005h
CWG3DBR_DBR5_SIZE                        equ 0001h
CWG3DBR_DBR5_LENGTH                      equ 0001h
CWG3DBR_DBR5_MASK                        equ 0020h
CWG3DBR_CWG3DBR_POSN                     equ 0000h
CWG3DBR_CWG3DBR_POSITION                 equ 0000h
CWG3DBR_CWG3DBR_SIZE                     equ 0006h
CWG3DBR_CWG3DBR_LENGTH                   equ 0006h
CWG3DBR_CWG3DBR_MASK                     equ 003Fh
CWG3DBR_CWG3DBR0_POSN                    equ 0000h
CWG3DBR_CWG3DBR0_POSITION                equ 0000h
CWG3DBR_CWG3DBR0_SIZE                    equ 0001h
CWG3DBR_CWG3DBR0_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR0_MASK                    equ 0001h
CWG3DBR_CWG3DBR1_POSN                    equ 0001h
CWG3DBR_CWG3DBR1_POSITION                equ 0001h
CWG3DBR_CWG3DBR1_SIZE                    equ 0001h
CWG3DBR_CWG3DBR1_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR1_MASK                    equ 0002h
CWG3DBR_CWG3DBR2_POSN                    equ 0002h
CWG3DBR_CWG3DBR2_POSITION                equ 0002h
CWG3DBR_CWG3DBR2_SIZE                    equ 0001h
CWG3DBR_CWG3DBR2_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR2_MASK                    equ 0004h
CWG3DBR_CWG3DBR3_POSN                    equ 0003h
CWG3DBR_CWG3DBR3_POSITION                equ 0003h
CWG3DBR_CWG3DBR3_SIZE                    equ 0001h
CWG3DBR_CWG3DBR3_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR3_MASK                    equ 0008h
CWG3DBR_CWG3DBR4_POSN                    equ 0004h
CWG3DBR_CWG3DBR4_POSITION                equ 0004h
CWG3DBR_CWG3DBR4_SIZE                    equ 0001h
CWG3DBR_CWG3DBR4_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR4_MASK                    equ 0010h
CWG3DBR_CWG3DBR5_POSN                    equ 0005h
CWG3DBR_CWG3DBR5_POSITION                equ 0005h
CWG3DBR_CWG3DBR5_SIZE                    equ 0001h
CWG3DBR_CWG3DBR5_LENGTH                  equ 0001h
CWG3DBR_CWG3DBR5_MASK                    equ 0020h

// Register: CWG3DBF
#define CWG3DBF CWG3DBF
CWG3DBF                                  equ 068Fh
// bitfield definitions
CWG3DBF_DBF_POSN                         equ 0000h
CWG3DBF_DBF_POSITION                     equ 0000h
CWG3DBF_DBF_SIZE                         equ 0006h
CWG3DBF_DBF_LENGTH                       equ 0006h
CWG3DBF_DBF_MASK                         equ 003Fh
CWG3DBF_DBF0_POSN                        equ 0000h
CWG3DBF_DBF0_POSITION                    equ 0000h
CWG3DBF_DBF0_SIZE                        equ 0001h
CWG3DBF_DBF0_LENGTH                      equ 0001h
CWG3DBF_DBF0_MASK                        equ 0001h
CWG3DBF_DBF1_POSN                        equ 0001h
CWG3DBF_DBF1_POSITION                    equ 0001h
CWG3DBF_DBF1_SIZE                        equ 0001h
CWG3DBF_DBF1_LENGTH                      equ 0001h
CWG3DBF_DBF1_MASK                        equ 0002h
CWG3DBF_DBF2_POSN                        equ 0002h
CWG3DBF_DBF2_POSITION                    equ 0002h
CWG3DBF_DBF2_SIZE                        equ 0001h
CWG3DBF_DBF2_LENGTH                      equ 0001h
CWG3DBF_DBF2_MASK                        equ 0004h
CWG3DBF_DBF3_POSN                        equ 0003h
CWG3DBF_DBF3_POSITION                    equ 0003h
CWG3DBF_DBF3_SIZE                        equ 0001h
CWG3DBF_DBF3_LENGTH                      equ 0001h
CWG3DBF_DBF3_MASK                        equ 0008h
CWG3DBF_DBF4_POSN                        equ 0004h
CWG3DBF_DBF4_POSITION                    equ 0004h
CWG3DBF_DBF4_SIZE                        equ 0001h
CWG3DBF_DBF4_LENGTH                      equ 0001h
CWG3DBF_DBF4_MASK                        equ 0010h
CWG3DBF_DBF5_POSN                        equ 0005h
CWG3DBF_DBF5_POSITION                    equ 0005h
CWG3DBF_DBF5_SIZE                        equ 0001h
CWG3DBF_DBF5_LENGTH                      equ 0001h
CWG3DBF_DBF5_MASK                        equ 0020h
CWG3DBF_CWG3DBF_POSN                     equ 0000h
CWG3DBF_CWG3DBF_POSITION                 equ 0000h
CWG3DBF_CWG3DBF_SIZE                     equ 0006h
CWG3DBF_CWG3DBF_LENGTH                   equ 0006h
CWG3DBF_CWG3DBF_MASK                     equ 003Fh
CWG3DBF_CWG3DBF0_POSN                    equ 0000h
CWG3DBF_CWG3DBF0_POSITION                equ 0000h
CWG3DBF_CWG3DBF0_SIZE                    equ 0001h
CWG3DBF_CWG3DBF0_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF0_MASK                    equ 0001h
CWG3DBF_CWG3DBF1_POSN                    equ 0001h
CWG3DBF_CWG3DBF1_POSITION                equ 0001h
CWG3DBF_CWG3DBF1_SIZE                    equ 0001h
CWG3DBF_CWG3DBF1_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF1_MASK                    equ 0002h
CWG3DBF_CWG3DBF2_POSN                    equ 0002h
CWG3DBF_CWG3DBF2_POSITION                equ 0002h
CWG3DBF_CWG3DBF2_SIZE                    equ 0001h
CWG3DBF_CWG3DBF2_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF2_MASK                    equ 0004h
CWG3DBF_CWG3DBF3_POSN                    equ 0003h
CWG3DBF_CWG3DBF3_POSITION                equ 0003h
CWG3DBF_CWG3DBF3_SIZE                    equ 0001h
CWG3DBF_CWG3DBF3_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF3_MASK                    equ 0008h
CWG3DBF_CWG3DBF4_POSN                    equ 0004h
CWG3DBF_CWG3DBF4_POSITION                equ 0004h
CWG3DBF_CWG3DBF4_SIZE                    equ 0001h
CWG3DBF_CWG3DBF4_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF4_MASK                    equ 0010h
CWG3DBF_CWG3DBF5_POSN                    equ 0005h
CWG3DBF_CWG3DBF5_POSITION                equ 0005h
CWG3DBF_CWG3DBF5_SIZE                    equ 0001h
CWG3DBF_CWG3DBF5_LENGTH                  equ 0001h
CWG3DBF_CWG3DBF5_MASK                    equ 0020h

