GopalSaraf/Practicals/PSDL/include/proc/pic16lf18855.inc
// Register: ZCD1CON
#define ZCD1CON ZCD1CON
ZCD1CON                                  equ 091Fh
// bitfield definitions
ZCD1CON_INTN_POSN                        equ 0000h
ZCD1CON_INTN_POSITION                    equ 0000h
ZCD1CON_INTN_SIZE                        equ 0001h
ZCD1CON_INTN_LENGTH                      equ 0001h
ZCD1CON_INTN_MASK                        equ 0001h
ZCD1CON_INTP_POSN                        equ 0001h
ZCD1CON_INTP_POSITION                    equ 0001h
ZCD1CON_INTP_SIZE                        equ 0001h
ZCD1CON_INTP_LENGTH                      equ 0001h
ZCD1CON_INTP_MASK                        equ 0002h
ZCD1CON_POL_POSN                         equ 0004h
ZCD1CON_POL_POSITION                     equ 0004h
ZCD1CON_POL_SIZE                         equ 0001h
ZCD1CON_POL_LENGTH                       equ 0001h
ZCD1CON_POL_MASK                         equ 0010h
ZCD1CON_OUT_POSN                         equ 0005h
ZCD1CON_OUT_POSITION                     equ 0005h
ZCD1CON_OUT_SIZE                         equ 0001h
ZCD1CON_OUT_LENGTH                       equ 0001h
ZCD1CON_OUT_MASK                         equ 0020h
ZCD1CON_EN_POSN                          equ 0007h
ZCD1CON_EN_POSITION                      equ 0007h
ZCD1CON_EN_SIZE                          equ 0001h
ZCD1CON_EN_LENGTH                        equ 0001h
ZCD1CON_EN_MASK                          equ 0080h
ZCD1CON_ZCD1INTN_POSN                    equ 0000h
ZCD1CON_ZCD1INTN_POSITION                equ 0000h
ZCD1CON_ZCD1INTN_SIZE                    equ 0001h
ZCD1CON_ZCD1INTN_LENGTH                  equ 0001h
ZCD1CON_ZCD1INTN_MASK                    equ 0001h
ZCD1CON_ZCD1INTP_POSN                    equ 0001h
ZCD1CON_ZCD1INTP_POSITION                equ 0001h
ZCD1CON_ZCD1INTP_SIZE                    equ 0001h
ZCD1CON_ZCD1INTP_LENGTH                  equ 0001h
ZCD1CON_ZCD1INTP_MASK                    equ 0002h
ZCD1CON_ZCD1POL_POSN                     equ 0004h
ZCD1CON_ZCD1POL_POSITION                 equ 0004h
ZCD1CON_ZCD1POL_SIZE                     equ 0001h
ZCD1CON_ZCD1POL_LENGTH                   equ 0001h
ZCD1CON_ZCD1POL_MASK                     equ 0010h
ZCD1CON_ZCD1OUT_POSN                     equ 0005h
ZCD1CON_ZCD1OUT_POSITION                 equ 0005h
ZCD1CON_ZCD1OUT_SIZE                     equ 0001h
ZCD1CON_ZCD1OUT_LENGTH                   equ 0001h
ZCD1CON_ZCD1OUT_MASK                     equ 0020h
ZCD1CON_ZCD1EN_POSN                      equ 0007h
ZCD1CON_ZCD1EN_POSITION                  equ 0007h
ZCD1CON_ZCD1EN_SIZE                      equ 0001h
ZCD1CON_ZCD1EN_LENGTH                    equ 0001h
ZCD1CON_ZCD1EN_MASK                      equ 0080h
ZCD1CON_ZCDINTN_POSN                     equ 0000h
ZCD1CON_ZCDINTN_POSITION                 equ 0000h
ZCD1CON_ZCDINTN_SIZE                     equ 0001h
ZCD1CON_ZCDINTN_LENGTH                   equ 0001h
ZCD1CON_ZCDINTN_MASK                     equ 0001h
ZCD1CON_ZCDINTP_POSN                     equ 0001h
ZCD1CON_ZCDINTP_POSITION                 equ 0001h
ZCD1CON_ZCDINTP_SIZE                     equ 0001h
ZCD1CON_ZCDINTP_LENGTH                   equ 0001h
ZCD1CON_ZCDINTP_MASK                     equ 0002h
ZCD1CON_ZCDPOL_POSN                      equ 0004h
ZCD1CON_ZCDPOL_POSITION                  equ 0004h
ZCD1CON_ZCDPOL_SIZE                      equ 0001h
ZCD1CON_ZCDPOL_LENGTH                    equ 0001h
ZCD1CON_ZCDPOL_MASK                      equ 0010h
ZCD1CON_ZCDOUT_POSN                      equ 0005h
ZCD1CON_ZCDOUT_POSITION                  equ 0005h
ZCD1CON_ZCDOUT_SIZE                      equ 0001h
ZCD1CON_ZCDOUT_LENGTH                    equ 0001h
ZCD1CON_ZCDOUT_MASK                      equ 0020h
ZCD1CON_ZCDEN_POSN                       equ 0007h
ZCD1CON_ZCDEN_POSITION                   equ 0007h
ZCD1CON_ZCDEN_SIZE                       equ 0001h
ZCD1CON_ZCDEN_LENGTH                     equ 0001h
ZCD1CON_ZCDEN_MASK                       equ 0080h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 098Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h
CMOUT_C2OUT_POSN                         equ 0001h
CMOUT_C2OUT_POSITION                     equ 0001h
CMOUT_C2OUT_SIZE                         equ 0001h
CMOUT_C2OUT_LENGTH                       equ 0001h
CMOUT_C2OUT_MASK                         equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0990h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0001h
CM1CON0_HYS_LENGTH                       equ 0001h
CM1CON0_HYS_MASK                         equ 0002h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_ON_POSN                          equ 0007h
CM1CON0_ON_POSITION                      equ 0007h
CM1CON0_ON_SIZE                          equ 0001h
CM1CON0_ON_LENGTH                        equ 0001h
CM1CON0_ON_MASK                          equ 0080h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1SP_POSN                        equ 0002h
CM1CON0_C1SP_POSITION                    equ 0002h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0004h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0991h
// bitfield definitions
CM1CON1_INTN_POSN                        equ 0000h
CM1CON1_INTN_POSITION                    equ 0000h
CM1CON1_INTN_SIZE                        equ 0001h
CM1CON1_INTN_LENGTH                      equ 0001h
CM1CON1_INTN_MASK                        equ 0001h
CM1CON1_INTP_POSN                        equ 0001h
CM1CON1_INTP_POSITION                    equ 0001h
CM1CON1_INTP_SIZE                        equ 0001h
CM1CON1_INTP_LENGTH                      equ 0001h
CM1CON1_INTP_MASK                        equ 0002h
CM1CON1_C1INTN_POSN                      equ 0000h
CM1CON1_C1INTN_POSITION                  equ 0000h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0001h
CM1CON1_C1INTP_POSN                      equ 0001h
CM1CON1_C1INTP_POSITION                  equ 0001h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0002h

// Register: CM1NSEL
#define CM1NSEL CM1NSEL
CM1NSEL                                  equ 0992h
// bitfield definitions
CM1NSEL_NCH_POSN                         equ 0000h
CM1NSEL_NCH_POSITION                     equ 0000h
CM1NSEL_NCH_SIZE                         equ 0003h
CM1NSEL_NCH_LENGTH                       equ 0003h
CM1NSEL_NCH_MASK                         equ 0007h
CM1NSEL_NCH0_POSN                        equ 0000h
CM1NSEL_NCH0_POSITION                    equ 0000h
CM1NSEL_NCH0_SIZE                        equ 0001h
CM1NSEL_NCH0_LENGTH                      equ 0001h
CM1NSEL_NCH0_MASK                        equ 0001h
CM1NSEL_NCH1_POSN                        equ 0001h
CM1NSEL_NCH1_POSITION                    equ 0001h
CM1NSEL_NCH1_SIZE                        equ 0001h
CM1NSEL_NCH1_LENGTH                      equ 0001h
CM1NSEL_NCH1_MASK                        equ 0002h
CM1NSEL_NCH2_POSN                        equ 0002h
CM1NSEL_NCH2_POSITION                    equ 0002h
CM1NSEL_NCH2_SIZE                        equ 0001h
CM1NSEL_NCH2_LENGTH                      equ 0001h
CM1NSEL_NCH2_MASK                        equ 0004h
CM1NSEL_C1NCH_POSN                       equ 0000h
CM1NSEL_C1NCH_POSITION                   equ 0000h
CM1NSEL_C1NCH_SIZE                       equ 0003h
CM1NSEL_C1NCH_LENGTH                     equ 0003h
CM1NSEL_C1NCH_MASK                       equ 0007h
CM1NSEL_C1NCH0_POSN                      equ 0000h
CM1NSEL_C1NCH0_POSITION                  equ 0000h
CM1NSEL_C1NCH0_SIZE                      equ 0001h
CM1NSEL_C1NCH0_LENGTH                    equ 0001h
CM1NSEL_C1NCH0_MASK                      equ 0001h
CM1NSEL_C1NCH1_POSN                      equ 0001h
CM1NSEL_C1NCH1_POSITION                  equ 0001h
CM1NSEL_C1NCH1_SIZE                      equ 0001h
CM1NSEL_C1NCH1_LENGTH                    equ 0001h
CM1NSEL_C1NCH1_MASK                      equ 0002h
CM1NSEL_C1NCH2_POSN                      equ 0002h
CM1NSEL_C1NCH2_POSITION                  equ 0002h
CM1NSEL_C1NCH2_SIZE                      equ 0001h
CM1NSEL_C1NCH2_LENGTH                    equ 0001h
CM1NSEL_C1NCH2_MASK                      equ 0004h

// Register: CM1PSEL
#define CM1PSEL CM1PSEL
CM1PSEL                                  equ 0993h
// bitfield definitions
CM1PSEL_PCH_POSN                         equ 0000h
CM1PSEL_PCH_POSITION                     equ 0000h
CM1PSEL_PCH_SIZE                         equ 0004h
CM1PSEL_PCH_LENGTH                       equ 0004h
CM1PSEL_PCH_MASK                         equ 000Fh
CM1PSEL_PCH0_POSN                        equ 0000h
CM1PSEL_PCH0_POSITION                    equ 0000h
CM1PSEL_PCH0_SIZE                        equ 0001h
CM1PSEL_PCH0_LENGTH                      equ 0001h
CM1PSEL_PCH0_MASK                        equ 0001h
CM1PSEL_PCH1_POSN                        equ 0001h
CM1PSEL_PCH1_POSITION                    equ 0001h
CM1PSEL_PCH1_SIZE                        equ 0001h
CM1PSEL_PCH1_LENGTH                      equ 0001h
CM1PSEL_PCH1_MASK                        equ 0002h
CM1PSEL_PCH2_POSN                        equ 0002h
CM1PSEL_PCH2_POSITION                    equ 0002h
CM1PSEL_PCH2_SIZE                        equ 0001h
CM1PSEL_PCH2_LENGTH                      equ 0001h
CM1PSEL_PCH2_MASK                        equ 0004h
CM1PSEL_C1PCH_POSN                       equ 0000h
CM1PSEL_C1PCH_POSITION                   equ 0000h
CM1PSEL_C1PCH_SIZE                       equ 0004h
CM1PSEL_C1PCH_LENGTH                     equ 0004h
CM1PSEL_C1PCH_MASK                       equ 000Fh
CM1PSEL_C1PCH0_POSN                      equ 0000h
CM1PSEL_C1PCH0_POSITION                  equ 0000h
CM1PSEL_C1PCH0_SIZE                      equ 0001h
CM1PSEL_C1PCH0_LENGTH                    equ 0001h
CM1PSEL_C1PCH0_MASK                      equ 0001h
CM1PSEL_C1PCH1_POSN                      equ 0001h
CM1PSEL_C1PCH1_POSITION                  equ 0001h
CM1PSEL_C1PCH1_SIZE                      equ 0001h
CM1PSEL_C1PCH1_LENGTH                    equ 0001h
CM1PSEL_C1PCH1_MASK                      equ 0002h
CM1PSEL_C1PCH2_POSN                      equ 0002h
CM1PSEL_C1PCH2_POSITION                  equ 0002h
CM1PSEL_C1PCH2_SIZE                      equ 0001h
CM1PSEL_C1PCH2_LENGTH                    equ 0001h
CM1PSEL_C1PCH2_MASK                      equ 0004h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0994h
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_ON_POSN                          equ 0007h
CM2CON0_ON_POSITION                      equ 0007h
CM2CON0_ON_SIZE                          equ 0001h
CM2CON0_ON_LENGTH                        equ 0001h
CM2CON0_ON_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2SP_POSN                        equ 0002h
CM2CON0_C2SP_POSITION                    equ 0002h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0004h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0995h
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NSEL
#define CM2NSEL CM2NSEL
CM2NSEL                                  equ 0996h
// bitfield definitions
CM2NSEL_NCH_POSN                         equ 0000h
CM2NSEL_NCH_POSITION                     equ 0000h
CM2NSEL_NCH_SIZE                         equ 0003h
CM2NSEL_NCH_LENGTH                       equ 0003h
CM2NSEL_NCH_MASK                         equ 0007h
CM2NSEL_NCH0_POSN                        equ 0000h
CM2NSEL_NCH0_POSITION                    equ 0000h
CM2NSEL_NCH0_SIZE                        equ 0001h
CM2NSEL_NCH0_LENGTH                      equ 0001h
CM2NSEL_NCH0_MASK                        equ 0001h
CM2NSEL_NCH1_POSN                        equ 0001h
CM2NSEL_NCH1_POSITION                    equ 0001h
CM2NSEL_NCH1_SIZE                        equ 0001h
CM2NSEL_NCH1_LENGTH                      equ 0001h
CM2NSEL_NCH1_MASK                        equ 0002h
CM2NSEL_NCH2_POSN                        equ 0002h
CM2NSEL_NCH2_POSITION                    equ 0002h
CM2NSEL_NCH2_SIZE                        equ 0001h
CM2NSEL_NCH2_LENGTH                      equ 0001h
CM2NSEL_NCH2_MASK                        equ 0004h
CM2NSEL_C2NCH_POSN                       equ 0000h
CM2NSEL_C2NCH_POSITION                   equ 0000h
CM2NSEL_C2NCH_SIZE                       equ 0003h
CM2NSEL_C2NCH_LENGTH                     equ 0003h
CM2NSEL_C2NCH_MASK                       equ 0007h
CM2NSEL_C2NCH0_POSN                      equ 0000h
CM2NSEL_C2NCH0_POSITION                  equ 0000h
CM2NSEL_C2NCH0_SIZE                      equ 0001h
CM2NSEL_C2NCH0_LENGTH                    equ 0001h
CM2NSEL_C2NCH0_MASK                      equ 0001h
CM2NSEL_C2NCH1_POSN                      equ 0001h
CM2NSEL_C2NCH1_POSITION                  equ 0001h
CM2NSEL_C2NCH1_SIZE                      equ 0001h
CM2NSEL_C2NCH1_LENGTH                    equ 0001h
CM2NSEL_C2NCH1_MASK                      equ 0002h
CM2NSEL_C2NCH2_POSN                      equ 0002h
CM2NSEL_C2NCH2_POSITION                  equ 0002h
CM2NSEL_C2NCH2_SIZE                      equ 0001h
CM2NSEL_C2NCH2_LENGTH                    equ 0001h
CM2NSEL_C2NCH2_MASK                      equ 0004h

// Register: CM2PSEL
#define CM2PSEL CM2PSEL
CM2PSEL                                  equ 0997h
// bitfield definitions
CM2PSEL_PCH_POSN                         equ 0000h
CM2PSEL_PCH_POSITION                     equ 0000h
CM2PSEL_PCH_SIZE                         equ 0004h
CM2PSEL_PCH_LENGTH                       equ 0004h
CM2PSEL_PCH_MASK                         equ 000Fh
CM2PSEL_PCH0_POSN                        equ 0000h
CM2PSEL_PCH0_POSITION                    equ 0000h
CM2PSEL_PCH0_SIZE                        equ 0001h
CM2PSEL_PCH0_LENGTH                      equ 0001h
CM2PSEL_PCH0_MASK                        equ 0001h
CM2PSEL_PCH1_POSN                        equ 0001h
CM2PSEL_PCH1_POSITION                    equ 0001h
CM2PSEL_PCH1_SIZE                        equ 0001h
CM2PSEL_PCH1_LENGTH                      equ 0001h
CM2PSEL_PCH1_MASK                        equ 0002h
CM2PSEL_PCH2_POSN                        equ 0002h
CM2PSEL_PCH2_POSITION                    equ 0002h
CM2PSEL_PCH2_SIZE                        equ 0001h
CM2PSEL_PCH2_LENGTH                      equ 0001h
CM2PSEL_PCH2_MASK                        equ 0004h
CM2PSEL_C2PCH_POSN                       equ 0000h
CM2PSEL_C2PCH_POSITION                   equ 0000h
CM2PSEL_C2PCH_SIZE                       equ 0004h
CM2PSEL_C2PCH_LENGTH                     equ 0004h
CM2PSEL_C2PCH_MASK                       equ 000Fh
CM2PSEL_C2PCH0_POSN                      equ 0000h
CM2PSEL_C2PCH0_POSITION                  equ 0000h
CM2PSEL_C2PCH0_SIZE                      equ 0001h
CM2PSEL_C2PCH0_LENGTH                    equ 0001h
CM2PSEL_C2PCH0_MASK                      equ 0001h
CM2PSEL_C2PCH1_POSN                      equ 0001h
CM2PSEL_C2PCH1_POSITION                  equ 0001h
CM2PSEL_C2PCH1_SIZE                      equ 0001h
CM2PSEL_C2PCH1_LENGTH                    equ 0001h
CM2PSEL_C2PCH1_MASK                      equ 0002h
CM2PSEL_C2PCH2_POSN                      equ 0002h
CM2PSEL_C2PCH2_POSITION                  equ 0002h
CM2PSEL_C2PCH2_SIZE                      equ 0001h
CM2PSEL_C2PCH2_LENGTH                    equ 0001h
CM2PSEL_C2PCH2_MASK                      equ 0004h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 0E0Fh
// bitfield definitions
CLCDATA_MLC1OUT_POSN                     equ 0000h
CLCDATA_MLC1OUT_POSITION                 equ 0000h
CLCDATA_MLC1OUT_SIZE                     equ 0001h
CLCDATA_MLC1OUT_LENGTH                   equ 0001h
CLCDATA_MLC1OUT_MASK                     equ 0001h
CLCDATA_MLC2OUT_POSN                     equ 0001h
CLCDATA_MLC2OUT_POSITION                 equ 0001h
CLCDATA_MLC2OUT_SIZE                     equ 0001h
CLCDATA_MLC2OUT_LENGTH                   equ 0001h
CLCDATA_MLC2OUT_MASK                     equ 0002h
CLCDATA_MLC3OUT_POSN                     equ 0002h
CLCDATA_MLC3OUT_POSITION                 equ 0002h
CLCDATA_MLC3OUT_SIZE                     equ 0001h
CLCDATA_MLC3OUT_LENGTH                   equ 0001h
CLCDATA_MLC3OUT_MASK                     equ 0004h
CLCDATA_MLC4OUT_POSN                     equ 0003h
CLCDATA_MLC4OUT_POSITION                 equ 0003h
CLCDATA_MLC4OUT_SIZE                     equ 0001h
CLCDATA_MLC4OUT_LENGTH                   equ 0001h
CLCDATA_MLC4OUT_MASK                     equ 0008h

